[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:55:36
     setModalShow(true);
   };
 
-  const rejectCallback = (cell) => {
-    setPendingStatus("REJECTED");
-    setPendingCell(cell);
-    setModalShow(true);
-  };
+  const rejectCallback = (cell) => {};
 
   const handleModalSubmit = (comments) => {
killedBy: ReviewsTable rejection flow sends PUT with REJECTED and notes
statusReason: Unable to find an element by: [data-testid="ModeratorCommentsModal-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
