[Killed] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:13:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/users"],
-    { method: "GET", url: "/api/admin/users" },
+    {},
     [],
   );
killedBy: AdminUsersPage tests renders empty table when backend unavailable
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'
