[Killed] BlockStatement
main/components/Users/UsersTable.jsx:21:34
       params: { id: row.id },
     }),
     {
-      onSuccess: (_data, row) => {
-        toast("Updated admin status for user " + row.givenName);
-        // stryker mutates by removing ?'s - when we are not admin, this page is not accessible, so currentUsers.root.user is guaranteed to have values
-        // non-self navigate behavior is tested implicitly via AdminUsersPage tests
-        // Stryker disable next-line OptionalChaining, ConditionalExpression
-        if (row.id === currentUser?.root?.user?.id) {
-          navigate("/");
-        }
-      },
+      onSuccess: (_data, row) => {},
       // skip cache invalidation for self-toggle: we're navigating away and are no longer admin, so the refetch would 403
       // Stryker disable next-line all : don't test internal caching of react query
killedBy: UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage; AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:34:53
       // Stryker disable next-line all : don't test internal caching of react query
       onSettled: (_data, _error, row) => {
         // Stryker disable next-line OptionalChaining, ConditionalExpression
-        if (row.id !== currentUser?.root?.user?.id) {
-          // Stryker disable next-line all : don't test internal caching of react query
-          queryClient.invalidateQueries(["/api/admin/users"]);
-        }
+        if (row.id !== currentUser?.root?.user?.id) {}
       },
     },
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  aria-label="admin"
  checked=""
  name="adminToggle"
  type="checkbox"

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:56:18
       params: { id: row.id },
     }),
     {
-      onSuccess: (_data, row) =>
-        toast("Updated moderator status for user " + row.givenName),
+      onSuccess: () => undefined,
     },
     // Stryker disable next-line all : don't test internal caching of react query
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Updated moderator status for user Phillip",
