[Killed] ObjectLiteral
main/components/MyReviews/ReviewForm.jsx:17:20
     reset,
     formState: { errors },
   } = useForm({
-    defaultValues: {
-      reviewerComments: "",
-      itemsStars: 5,
-      dateItemServed: new Date().toISOString().slice(0, 16),
-    },
+    defaultValues: {},
   });
 
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  1

[Killed] MethodExpression
main/components/MyReviews/ReviewForm.jsx:20:23
     defaultValues: {
       reviewerComments: "",
       itemsStars: 5,
-      dateItemServed: new Date().toISOString().slice(0, 16),
+      dateItemServed: new Date().toISOString(),
     },
   });
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:25:9
   });
 
   useEffect(() => {
-    if (initialContents?.reviewerComments !== undefined) {
+    if (false) {
       reset({
         reviewerComments: initialContents.reviewerComments,
killedBy: EditReviewPage tests renders form fields with expected defaults
statusReason: Unable to find an element with the display value: Old comment.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/components/MyReviews/ReviewForm.jsx:29:25
       reset({
         reviewerComments: initialContents.reviewerComments,
         itemsStars: initialContents.itemsStars,
-        dateItemServed: initialContents.dateItemServed?.slice(0, 16) ?? "",
+        dateItemServed: initialContents.dateItemServed ?? "",
       });
     }
killedBy: ReviewForm truncates dateItemServed from initialContents for datetime-local input
statusReason: expect(element).toHaveValue(2026-05-18T23:57)

Expected the element to have value:
  2026-05-18T23:57
Received:


Ignored nodes: comments, script, style

[Killed] ArrayDeclaration
main/components/MyReviews/ReviewForm.jsx:32:6
         dateItemServed: initialContents.dateItemServed?.slice(0, 16) ?? "",
       });
     }
-  }, [initialContents, reset]);
+  }, []);
 
   const onSubmit = (data) => {
killedBy: EditReviewPage tests renders form fields with expected defaults
statusReason: Unable to find an element with the display value: Old comment.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/MyReviews/ReviewForm.jsx:35:18
   }, [initialContents, reset]);
 
   const onSubmit = (data) => {
-    submitAction({
-      reviewerComments: data.reviewerComments,
-      itemsStars: Number(data.itemsStars),
-      dateItemServed: data.dateItemServed,
-    });
+    submitAction({});
 
     reset();
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post; EditReviewPage tests submits updated review and navigates back; ReviewForm uses empty date when initialContents has no dateItemServed
statusReason: expected { itemId: undefined, …(3) } to deeply equal { itemId: undefined, …(3) }

[Killed] ArrayDeclaration
main/components/MyReviews/ReviewForm.jsx:72:12
       <Form.Group className="mb-3">
         <Form.Label htmlFor="itemsStars">Stars (1 to 5)</Form.Label>
         <Form.Select id="itemsStars" {...register("itemsStars")}>
-          {[1, 2, 3, 4, 5].map((n) => (
+          {[].map((n) => (
             <option key={n} value={n}>
               {n}
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  undefined

[Killed] StringLiteral
main/components/MyReviews/ReviewForm.jsx:88:24
         <Form.Control
           id="dateItemServed"
           type="datetime-local"
-          {...register("dateItemServed")}
+          {...register("")}
         />
       </Form.Group>
killedBy: ReviewForm shows required error and does not submit when comments are empty
statusReason: Cannot read properties of undefined (reading '_f')
