[Killed] StringLiteral
main/pages/Admin/ModeratorsIndexPage.jsx:15:15
     status: _status,
   } = useBackend(
     ["/api/admin/moderators/get"],
-    { method: "GET", url: "/api/admin/moderators/get" },
+    { method: "", url: "/api/admin/moderators/get" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: ModeratorsIndexPage tests renders empty table when backend unavailable
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'
