[Killed] OptionalChaining
main/pages/Reviews/EditReviewPage.jsx:22:20
     {},
   );
 
-  const itemName = review.item?.name;
+  const itemName = review.item.name;
 
   const submitReview = async (formData) => {
killedBy: EditReviewPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] UnaryOperator
main/pages/Reviews/EditReviewPage.jsx:32:16
         },
       });
       toast(`Review updated for ${itemName}`);
-      navigate(-1);
+      navigate(+1);
     } catch (err) {
       toast.error(
killedBy: EditReviewPage tests submits updated review and navigates back
statusReason: expected "vi.fn()" to be called with arguments: [ -1 ]

Received: 

  1st vi.fn() call:

  [
-   -1,
