[Killed] BlockStatement
main/components/Users/UsersTable.jsx:44:38
     ["/api/admin/users"],
   );
   // toggle admin status
-  const handleAdminToggle = (row) => {
-    toggleAdminMutation.mutate(row);
-  };
+  const handleAdminToggle = (row) => {};
 
   // helper function to toggle moderator status
killedBy: UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage; AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
