[Killed] ObjectLiteral
main/pages/Admin/ModeratorsCreatePage.jsx:12:13
   const objectToAxiosParams = (moderator) => ({
     url: "/api/admin/moderators/post",
     method: "POST",
-    params: {
-      email: moderator.email,
-    },
+    params: {},
   });
 
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected {} to deeply equal { email: 'testemailone@ucsb.edu' }

[Killed] StringLiteral
main/pages/Admin/ModeratorsCreatePage.jsx:19:32
 
   const onSuccess = (moderator) => {
     toast(`New moderator added - email: ${moderator.email}`);
-    if (!storybook) navigation("/admin/moderators");
+    if (!storybook) navigation("");
   };
 
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/moderators' ]

Received: 

  1st vi.fn() call:

  [
-   "/admin/moderators",
