[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <NavDropdown
-                    title="Admin"
-                    id="appnavbar-admin-dropdown"
-                    data-testid="appnavbar-admin-dropdown"
-                  >
-                    <NavDropdown.Item href="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/admins">
-                      Admins
-                    </NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/moderators">
-                      Moderators
-                    </NavDropdown.Item>
-                  </NavDropdown>
-                </>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <>
+                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item href="/admin/users">
+                      Users
+                    </NavDropdown.Item>
+                    <NavDropdown.Item href="/admin/admins">
+                      Admins
+                    </NavDropdown.Item>
+                    <NavDropdown.Item href="/admin/moderators">
+                      Moderators
+                    </NavDropdown.Item>
+                  </NavDropdown>
+                </>}
               {(hasRole(currentUser, "ROLE_ADMIN") ||
                 hasRole(currentUser, "ROLE_MODERATOR")) && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.jsx:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <NavDropdown
-                    title="Admin"
-                    id="appnavbar-admin-dropdown"
-                    data-testid="appnavbar-admin-dropdown"
-                  >
-                    <NavDropdown.Item href="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/admins">
-                      Admins
-                    </NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/moderators">
-                      Moderators
-                    </NavDropdown.Item>
-                  </NavDropdown>
-                </>
-              )}
+              {false}
               {(hasRole(currentUser, "ROLE_ADMIN") ||
                 hasRole(currentUser, "ROLE_MODERATOR")) && (

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:71:16
                   </NavDropdown>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_MODERATOR")) && (
-                <>
-                  <NavDropdown
-                    title="Moderate"
-                    id="appnavbar-moderate-dropdown"
-                    data-testid="appnavbar-moderate-dropdown"
-                  >
-                    <NavDropdown.Item href="/moderate/aliases">
-                      Alias Requests
-                    </NavDropdown.Item>
-                    <NavDropdown.Item href="/moderate">
-                      Moderate Reviews
-                    </NavDropdown.Item>
-                  </NavDropdown>
-                </>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_MODERATOR") || <>
+                  <NavDropdown title="Moderate" id="appnavbar-moderate-dropdown" data-testid="appnavbar-moderate-dropdown">
+                    <NavDropdown.Item href="/moderate/aliases">
+                      Alias Requests
+                    </NavDropdown.Item>
+                    <NavDropdown.Item href="/moderate">
+                      Moderate Reviews
+                    </NavDropdown.Item>
+                  </NavDropdown>
+                </>}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  aria-expanded="false"
  class="dropdown-toggle nav-link"
  href="#"
  id="appnavbar-moderate-dropdown"
  role="button"
