[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:25:9
   const itemName = review.item?.name;
 
   const submitReview = async (formData) => {
-    try {
-      await axios.put("/api/reviews/reviewer", formData, {
-        params: {
-          id,
-        },
-      });
-      toast(`Review updated for ${itemName}`);
-      navigate(-1);
-    } catch (err) {
+    try {} catch (err) {
       toast.error(
         `Error updating review: ${err.response?.data?.error || err.message}`,
killedBy: EditReviewPage tests submits updated review and navigates back
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
