[Killed] BlockStatement
src/main/utils/Reviews.jsx:18:76
   };
 }
 
-export function cellToAxiosParamsModerate(cell, status, moderatorComments) {
-  return {
-    url: "/api/reviews/moderate",
-    method: "PUT",
-    params: {
-      id: cell.row.original.id,
-      status: status,
-      moderatorComments: moderatorComments,
-    },
-  };
-}
+export function cellToAxiosParamsModerate(cell, status, moderatorComments) {}
 
 export function onModerateSuccess() {
killedBy: Reviews cellToAxiosParamsModerate builds PUT params for an APPROVED decision with comments
statusReason: expected undefined to deeply equal { url: '/api/reviews/moderate', …(2) }
