[Killed] ObjectLiteral
main/pages/Admin/ModeratorsCreatePage.jsx:9:47
 
 export default function ModeratorsCreatePage({ storybook = false }) {
   const navigation = useNavigate();
-  const objectToAxiosParams = (moderator) => ({
-    url: "/api/admin/moderators/post",
-    method: "POST",
-    params: {
-      email: moderator.email,
-    },
-  });
+  const objectToAxiosParams = (moderator) => ({});
 
   const onSuccess = (moderator) => {
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/ModeratorsCreatePage.jsx:18:11
   });
 
   const onSuccess = (moderator) => {
-    toast(`New moderator added - email: ${moderator.email}`);
+    toast(``);
     if (!storybook) navigation("/admin/moderators");
   };
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /admin/moderators
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New moderator added - email: testemailone@ucsb.edu",
