[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:34:13
       // Stryker disable next-line all : don't test internal caching of react query
       onSettled: (_data, _error, row) => {
         // Stryker disable next-line OptionalChaining
-        if (row.id !== currentUser?.root?.user?.id) {
+        if (false) {
           // Stryker disable next-line all : don't test internal caching of react query
           queryClient.invalidateQueries(["/api/admin/users"]);
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  aria-label="admin"
  checked=""
  name="adminToggle"
  type="checkbox"
