[Killed] BlockStatement
main/components/Users/UsersTable.jsx:21:34
       params: { id: row.id },
     }),
     {
-      onSuccess: (_data, row) => {
-        toast("Updated admin status for user " + row.givenName);
-        // stryker mutates by removing ?'s - when we are not admin, this page is not accessible, so currentUsers.root.user is guaranteed to have values
-        // Stryker disable next-line OptionalChaining
-        if (row.id === currentUser?.root?.user?.id) {
-          navigate("/");
-        }
-      },
+      onSuccess: (_data, row) => {},
       // skip cache invalidation for self-toggle: we're navigating away and are no longer admin, so the refetch would 403
       // Stryker disable next-line all : don't test internal caching of react query
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds; UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:25:13
         toast("Updated admin status for user " + row.givenName);
         // stryker mutates by removing ?'s - when we are not admin, this page is not accessible, so currentUsers.root.user is guaranteed to have values
         // Stryker disable next-line OptionalChaining
-        if (row.id === currentUser?.root?.user?.id) {
+        if (false) {
           navigate("/");
         }
killedBy: UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage
statusReason: expected "vi.fn()" to be called with arguments: [ '/' ]

Number of calls: 0

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:33:53
       // Stryker disable next-line all : don't test internal caching of react query
       onSettled: (_data, _error, row) => {
         // Stryker disable next-line OptionalChaining
-        if (row.id !== currentUser?.root?.user?.id) {
-          queryClient.invalidateQueries(["/api/admin/users"]);
-        }
+        if (row.id !== currentUser?.root?.user?.id) {}
       },
     },
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  aria-label="admin"
  checked=""
  name="adminToggle"
  type="checkbox"

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:33:13
       // Stryker disable next-line all : don't test internal caching of react query
       onSettled: (_data, _error, row) => {
         // Stryker disable next-line OptionalChaining
-        if (row.id !== currentUser?.root?.user?.id) {
+        if (row.id === currentUser?.root?.user?.id) {
           queryClient.invalidateQueries(["/api/admin/users"]);
         }
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  aria-label="admin"
  checked=""
  name="adminToggle"
  type="checkbox"

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:51:15
     (row) => ({
       url: "/api/admin/toggleModerator",
       method: "PUT",
-      params: { id: row.id },
+      params: {},
     }),
     {
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected {} to deeply equal { id: 2 }

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:53:5
       method: "PUT",
       params: { id: row.id },
     }),
-    {
-      onSuccess: (_data, row) =>
-        toast("Updated moderator status for user " + row.givenName),
-    },
+    {},
     // Stryker disable next-line all : don't test internal caching of react query
     ["/api/admin/users"],
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Updated moderator status for user Phillip",

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:86:26
     {
       Header: "Admin",
       id: "admin",
-      accessor: (row) => {
-        return (
-          // Stryker disable next-line StringLiteral
-          <div style={{ display: "flex", gap: "5%", justifyContent: "center" }}>
-            {/* checkbox: toggle admin status */}
-            <input
-              type="checkbox"
-              aria-label="admin"
-              name="adminToggle"
-              checked={row.admin}
-              onChange={() => handleAdminToggle(row)}
-            />
-          </div>
-        );
-      },
+      accessor: (row) => {},
     },
     {
killedBy: UserTable tests Has the expected colum headers and content; AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: Unable to find an accessible element with the role "checkbox" and name `/admin/i`

Here are the accessible roles:

  cell:

  Name "1":
  <td

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:105:26
     {
       Header: "Moderator",
       id: "moderator",
-      accessor: (row) => {
-        return (
-          // Stryker disable next-line StringLiteral
-          <div style={{ display: "flex", justifyContent: "center" }}>
-            {/* checkbox: toggle moderator status */}
-            <input
-              type="checkbox"
-              aria-label="moderator"
-              name="moderatorToggle"
-              checked={row.moderator}
-              onChange={() => handleModeratorToggle(row)}
-            />
-          </div>
-        );
-      },
+      accessor: (row) => {},
     },
     {
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds; UserTable tests Has the expected colum headers and content
statusReason: Unable to find an accessible element with the role "checkbox" and name `/moderator/i`

Here are the accessible roles:

  cell:

  Name "2":
  <td

[Timeout] ArrowFunction
main/components/Users/UsersTable.jsx:115:25
               aria-label="moderator"
               name="moderatorToggle"
               checked={row.moderator}
-              onChange={() => handleModeratorToggle(row)}
+              onChange={() => undefined}
             />
           </div>
