[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:27:44
 
   const [comments, setComments] = React.useState(initialComments);
 
-  const [stars, setStars] = React.useState(contents.itemsStars || 5);
+  const [stars, setStars] = React.useState(false);
 
   const initialDateServed = formatDateForInput(contents.dateItemServed);
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  1

[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:33:25
 
   const [dateServed, setDateServed] = React.useState(initialDateServed);
 
-  React.useEffect(() => {
-    if (!initialContents) {
-      return;
-    }
-
-    // Stryker disable next-line all : default empty string is used when edited review has no comment
-    setComments(initialContents.reviewerComments || "");
-
-    setStars(initialContents.itemsStars || 5);
-
-    setDateServed(formatDateForInput(initialContents.dateItemServed));
-  }, [initialContents]);
+  React.useEffect(() => {}, [initialContents]);
 
   const handleSubmit = (e) => {
killedBy: EditReviewPage tests renders form fields with expected defaults
statusReason: Unable to find an element with the display value: Old comment.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:34:9
   const [dateServed, setDateServed] = React.useState(initialDateServed);
 
   React.useEffect(() => {
-    if (!initialContents) {
+    if (false) {
       return;
     }
killedBy: MyReviewsCreatePage handles missing query params renders default view
statusReason: Cannot read properties of undefined (reading 'reviewerComments')

[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:41:14
     // Stryker disable next-line all : default empty string is used when edited review has no comment
     setComments(initialContents.reviewerComments || "");
 
-    setStars(initialContents.itemsStars || 5);
+    setStars(false);
 
     setDateServed(formatDateForInput(initialContents.dateItemServed));
killedBy: EditReviewPage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(3)

Expected the element to have value:
  3
Received:
  1

[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:46:31
     setDateServed(formatDateForInput(initialContents.dateItemServed));
   }, [initialContents]);
 
-  const handleSubmit = (e) => {
-    e.preventDefault();
-
-    submitAction({
-      reviewerComments: comments,
-      itemStars: stars,
-      dateItemServed: dateServed,
-    });
-  };
+  const handleSubmit = (e) => {};
 
   return (
killedBy: EditReviewPage tests submits updated review and navigates back; MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
