[Killed] BlockStatement
main/pages/Reviews/PostReviewPage.jsx:30:9
   const itemName = menuItems.name;
 
   const submitReview = async (formData) => {
-    try {
-      await axios.post("/api/reviews/post", null, {
-        params: {
-          itemId: id,
-          reviewerComments: formData.reviewerComments,
-          itemsStars: formData.itemStars,
-          dateItemServed: formData.dateItemServed,
-        },
-      });
-      // Stryker disable next-line all : itemName will be defined
-      toast(`Review submitted for ${itemName}`);
-      navigate(-1);
-    } catch (err) {
+    try {} catch (err) {
       toast.error(
         `Error submitting review: ${err.response?.data?.error || err.message}`,
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
