[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:35:35
       navigate(-1);
     } catch (err) {
       toast.error(
-        `Error updating review: ${err.response?.data?.error || err.message}`,
+        `Error updating review: ${false}`,
       );
     }
killedBy: EditReviewPage tests shows error toast on network error during edit with fallback message
statusReason: Unable to find an element with the text: /Error updating review: timeout of 0ms exceeded/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
