[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:14:5
   const contents = initialContents || {};
   // Stryker disable next-line all : default empty string prevents uncontrolled input warnings
   const [comments, setComments] = React.useState(
-    contents.reviewerComments || "",
+    false,
   );
 
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  false

[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:14:5
   const contents = initialContents || {};
   // Stryker disable next-line all : default empty string prevents uncontrolled input warnings
   const [comments, setComments] = React.useState(
-    contents.reviewerComments || "",
+    true,
   );
 
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  true

[Killed] LogicalOperator
main/components/MyReviews/ReviewForm.jsx:17:44
     contents.reviewerComments || "",
   );
 
-  const [stars, setStars] = React.useState(contents.itemsStars || 5);
+  const [stars, setStars] = React.useState(contents.itemsStars && 5);
 
   const [dateServed, setDateServed] = React.useState(() => {
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  1

[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:17:44
     contents.reviewerComments || "",
   );
 
-  const [stars, setStars] = React.useState(contents.itemsStars || 5);
+  const [stars, setStars] = React.useState(true);
 
   const [dateServed, setDateServed] = React.useState(() => {
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(5)

Expected the element to have value:
  5
Received:
  1

[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:19:60
 
   const [stars, setStars] = React.useState(contents.itemsStars || 5);
 
-  const [dateServed, setDateServed] = React.useState(() => {
-    // Stryker disable next-line all : date fallback only applies when there is no initial served date
-    return (
-      contents.dateItemServed?.slice(0, 16) ||
-      new Date().toISOString().slice(0, 16)
-    );
-  });
+  const [dateServed, setDateServed] = React.useState(() => {});
 
   React.useEffect(() => {
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] LogicalOperator
main/components/MyReviews/ReviewForm.jsx:22:7
   const [dateServed, setDateServed] = React.useState(() => {
     // Stryker disable next-line all : date fallback only applies when there is no initial served date
     return (
-      contents.dateItemServed?.slice(0, 16) ||
-      new Date().toISOString().slice(0, 16)
+      contents.dateItemServed?.slice(0, 16) && new Date().toISOString().slice(0, 16)
     );
   });
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Timeout] MethodExpression
main/components/MyReviews/ReviewForm.jsx:22:7
   const [dateServed, setDateServed] = React.useState(() => {
     // Stryker disable next-line all : date fallback only applies when there is no initial served date
     return (
-      contents.dateItemServed?.slice(0, 16) ||
+      contents.dateItemServed ||
       new Date().toISOString().slice(0, 16)
     );

[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:27:25
     );
   });
 
-  React.useEffect(() => {
-    if (!initialContents) {
-      return;
-    }
-    // Stryker disable next-line all : default empty string is used when edited review has no comment
-    setComments(initialContents.reviewerComments || "");
-    setStars(initialContents.itemsStars || 5);
-    // Stryker disable next-line all : date fallback only applies when editing review has no served date
-    setDateServed(initialContents.dateItemServed?.slice(0, 16) || new Date().toISOString().slice(0, 16));
-  }, [initialContents]);
+  React.useEffect(() => {}, [initialContents]);
 
   const handleSubmit = (e) => {
killedBy: EditReviewPage tests renders form fields with expected defaults
statusReason: Unable to find an element with the display value: Old comment.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:28:9
   });
 
   React.useEffect(() => {
-    if (!initialContents) {
+    if (true) {
       return;
     }
killedBy: EditReviewPage tests renders form fields with expected defaults
statusReason: Unable to find an element with the display value: Old comment.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:33:14
     }
     // Stryker disable next-line all : default empty string is used when edited review has no comment
     setComments(initialContents.reviewerComments || "");
-    setStars(initialContents.itemsStars || 5);
+    setStars(true);
     // Stryker disable next-line all : date fallback only applies when editing review has no served date
     setDateServed(initialContents.dateItemServed?.slice(0, 16) || new Date().toISOString().slice(0, 16));
killedBy: EditReviewPage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(3)

Expected the element to have value:
  3
Received:
  1
