[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:28:44
 
   const itemName = review.item?.name;
 
-  const submitReview = async (formData) => {
-    try {
-      await axios.put("/api/reviews/reviewer", formData, {
-        params: {
-          id,
-        },
-      });
-      // Stryker disable next-line all : itemName will be defined
-      toast(`Review updated for ${itemName}`);
-      navigate(-1);
-    } catch (err) {
-      toast.error(
-        `Error updating review: ${err.response?.data?.error || err.message}`,
-      );
-    }
-  };
+  const submitReview = async (formData) => {};
 
   return (
killedBy: EditReviewPage tests submits updated review and navigates back
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:38:19
       // Stryker disable next-line all : itemName will be defined
       toast(`Review updated for ${itemName}`);
       navigate(-1);
-    } catch (err) {
-      toast.error(
-        `Error updating review: ${err.response?.data?.error || err.message}`,
-      );
-    }
+    } catch (err) {}
   };
 
killedBy: EditReviewPage tests shows error toast on network error during edit with fallback message
statusReason: Unable to find an element with the text: /Error updating review: timeout of 0ms exceeded/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Reviews/EditReviewPage.jsx:40:35
       navigate(-1);
     } catch (err) {
       toast.error(
-        `Error updating review: ${err.response?.data?.error || err.message}`,
+        `Error updating review: ${err.response?.data?.error && err.message}`,
       );
     }
killedBy: EditReviewPage tests shows error toast on network error during edit with fallback message
statusReason: Unable to find an element with the text: /Error updating review: timeout of 0ms exceeded/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Reviews/EditReviewPage.jsx:50:28
       <div className="pt-2">
         <h1>Edit review with id {id}</h1>
         <ReviewForm
-          initialItemName={review.item?.name}
+          initialItemName={review.item.name}
           initialContents={review}
           submitAction={submitReview}
killedBy: EditReviewPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'name')
