[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:19:46
   moderatorOptions,
 }) {
   const navigate = useNavigate();
-  const [modalShow, setModalShow] = useState(false);
+  const [modalShow, setModalShow] = useState(true);
   const [pendingStatus, setPendingStatus] = useState(null);
   const [pendingCell, setPendingCell] = useState(null);
killedBy: ModerateReviewsPage moderator sees moderation actions and no dialog on load
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
  data-testid="ModeratorCommentsModal-title"
>
  Reject Review
</div> instead

[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:131:36
     <>
       <ModeratorCommentsModal
         show={modalShow}
-        onHide={() => setModalShow(false)}
+        onHide={() => setModalShow(true)}
         status={pendingStatus}
         onSubmit={handleModalSubmit}
killedBy: ReviewsTable dismissing the modal with cancel does not call moderate API
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
  data-testid="ModeratorCommentsModal-title"
>
  Approve Review
</div> instead
