[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:26:13
         // stryker mutates by removing ?'s - when we are not admin, this page is not accessible, so currentUsers.root.user is guaranteed to have values
         // non-self navigate behavior is tested implicitly via AdminUsersPage tests
         // Stryker disable next-line OptionalChaining, ConditionalExpression
-        if (row.id === currentUser?.root?.user?.id) {
+        if (row.id !== currentUser?.root?.user?.id) {
           navigate("/");
         }
killedBy: UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage
statusReason: expected "vi.fn()" to be called with arguments: [ '/' ]

Number of calls: 0

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:34:13
       // Stryker disable next-line all : don't test internal caching of react query
       onSettled: (_data, _error, row) => {
         // Stryker disable next-line OptionalChaining, ConditionalExpression
-        if (row.id !== currentUser?.root?.user?.id) {
+        if (row.id === currentUser?.root?.user?.id) {
           // Stryker disable next-line all : don't test internal caching of react query
           queryClient.invalidateQueries(["/api/admin/users"]);
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  aria-label="admin"
  checked=""
  name="adminToggle"
  type="checkbox"

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:88:26
     {
       Header: "Admin",
       id: "admin",
-      accessor: (row) => {
-        return (
-          // Stryker disable next-line StringLiteral, ObjectLiteral
-          <div style={{ display: "flex", gap: "5%", justifyContent: "center" }}>
-            {/* checkbox: toggle admin status */}
-            <input
-              type="checkbox"
-              aria-label="admin"
-              name="adminToggle"
-              checked={row.admin}
-              onChange={() => handleAdminToggle(row)}
-            />
-          </div>
-        );
-      },
+      accessor: (row) => {},
     },
     {
killedBy: UserTable tests Has the expected colum headers and content; AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: Unable to find an accessible element with the role "checkbox" and name `/admin/i`

Here are the accessible roles:

  cell:

  Name "1":
  <td
