[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.jsx:13:46
   testIdPrefix = "RoleEmailTable",
   customDeleteCallback = null,
 }) {
-  const cellToAxiosParamsDelete = (cell) => ({
-    url: deleteEndpoint,
-    method: "DELETE",
-    params: {
-      email: cell.row.original.email,
-    },
-  });
+  const cellToAxiosParamsDelete = (cell) => ({});
 
   const onDeleteSuccess = (message) => {
killedBy: AdminsIndexPage tests what happens when you click delete; ModeratorsIndexPage tests what happens when you click delete; RoleEmailTable Check defaults for api endpoints
statusReason: expected "vi.fn()" to be called with arguments: [ 'first moderator deleted' ]

Received: 

  1st vi.fn() call:

  [
-   "first moderator deleted",

[Killed] LogicalOperator
main/components/Users/RoleEmailTable.jsx:32:5
   );
 
   const deleteCallback =
-    customDeleteCallback || ((cell) => deleteMutation.mutate(cell));
+    customDeleteCallback && (cell => deleteMutation.mutate(cell));
 
   const columns = [
killedBy: ModeratorsIndexPage tests what happens when you click delete; RoleEmailTable calls deleteCallback when Delete button clicked; AdminsIndexPage tests what happens when you click delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'first moderator deleted' ]

Received: 

  1st vi.fn() call:

  [
-   "first moderator deleted",

[Killed] ConditionalExpression
main/components/Users/RoleEmailTable.jsx:32:5
   );
 
   const deleteCallback =
-    customDeleteCallback || ((cell) => deleteMutation.mutate(cell));
+    true;
 
   const columns = [
killedBy: AdminsIndexPage tests what happens when you click delete; RoleEmailTable calls deleteCallback when Delete button clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'first moderator deleted' ]

Received: 

  1st vi.fn() call:

  [
-   "first moderator deleted",
