[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:50:22
   // Stryker restore all
 
   const approveCallback = (cell) => {
-    setPendingStatus("APPROVED");
+    setPendingStatus("");
     setPendingCell(cell);
     setModalShow(true);
killedBy: ReviewsTable approve opens comments modal with correct title; ModerateReviewsPage end-to-end approve from page sends moderation PUT
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve Review
Received:
  Reject Review

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:56:22
   };
 
   const rejectCallback = (cell) => {
-    setPendingStatus("REJECTED");
+    setPendingStatus("");
     setPendingCell(cell);
     setModalShow(true);
killedBy: ReviewsTable rejection flow sends PUT with REJECTED and notes
statusReason: expected { id: 1, status: '', …(1) } to deeply equal { id: 1, status: 'REJECTED', …(1) }

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:114:25
     );
   }
 
-  if (moderatorOptions) {
-    columns.splice(1, 0, {
-      Header: "Reviewer Email",
-      accessor: "reviewer.email",
-    });
-    columns.push(
-      ButtonColumn("Approve", "primary", approveCallback, "Reviewstable"),
-    );
-    columns.push(
-      ButtonColumn("Reject", "danger", rejectCallback, "Reviewstable"),
-    );
-  }
+  if (moderatorOptions) {}
 
   return (
killedBy: ReviewsTable approve opens comments modal with correct title
statusReason: Unable to find an element with the text: Reviewer Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:117:17
   if (moderatorOptions) {
     columns.splice(1, 0, {
       Header: "Reviewer Email",
-      accessor: "reviewer.email",
+      accessor: "",
     });
     columns.push(
killedBy: ModerateReviewsPage moderator sees moderation actions and no dialog on load; ReviewsTable approve opens comments modal with correct title
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-reviewer.email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
