[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:15:5
 
   // helper function to toggle admin status
   const toggleAdminMutation = useBackendMutation(
-    (row) => ({
-      url: "/api/admin/toggleAdmin",
-      method: "PUT",
-      params: { id: row.id },
-    }),
+    () => undefined,
     {
       onSuccess: (_data, row) => {
killedBy: UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage; AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Updated admin status for user Phill",

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:63:42
     ["/api/admin/users"],
   );
   // toggle moderator status
-  const handleModeratorToggle = (row) => {
-    toggleModeratorMutation.mutate(row);
-  };
+  const handleModeratorToggle = (row) => {};
 
   // the table
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected 1 to be greater than or equal to 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:107:26
     {
       Header: "Moderator",
       id: "moderator",
-      accessor: (row) => {
-        return (
-          // Stryker disable next-line StringLiteral, ObjectLiteral
-          <div style={{ display: "flex", justifyContent: "center" }}>
-            {/* checkbox: toggle moderator status */}
-            <input
-              type="checkbox"
-              aria-label="moderator"
-              name="moderatorToggle"
-              checked={row.moderator}
-              onChange={() => handleModeratorToggle(row)}
-            />
-          </div>
-        );
-      },
+      accessor: (row) => {},
     },
     {
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds; UserTable tests Has the expected colum headers and content
statusReason: Unable to find an accessible element with the role "checkbox" and name `/moderator/i`

Here are the accessible roles:

  cell:

  Name "2":
  <td

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:149:59
     },
   ];
 
-  return <OurTable data={users} columns={columns} testid={"UsersTable"} />;
+  return <OurTable data={users} columns={columns} testid={""} />;
 }
 
killedBy: UserTable tests Has the expected colum headers and content; AdminUsersPage tests renders users table with data
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
