[Killed] ArrowFunction
main/components/Users/RoleEmailTable.jsx:13:35
   testIdPrefix = "RoleEmailTable",
   customDeleteCallback = null,
 }) {
-  const cellToAxiosParamsDelete = (cell) => ({
-    url: deleteEndpoint,
-    method: "DELETE",
-    params: {
-      email: cell.row.original.email,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onDeleteSuccess = (message) => {
killedBy: RoleEmailTable Check defaults for api endpoints; ModeratorsIndexPage tests what happens when you click delete; AdminsIndexPage tests what happens when you click delete
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ArrayDeclaration
main/components/Users/RoleEmailTable.jsx:28:5
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    [getEndpoint],
+    [],
   );
 
killedBy: RoleEmailTable Check defaults for api endpoints
statusReason: expected "invalidateQueries" to be called with arguments: [ [ '/api/admin/all' ] ]

Received: 

  1st invalidateQueries call:

  [
-   [
