[Killed] BlockStatement
main/components/AliasApproval/AliasApprovalTable.jsx:19:25
     },
   ];
 
-  if (moderatorOptions) {
-    columns.push(ButtonColumn("Approve", "primary", approveCallback, testid));
-    columns.push(ButtonColumn("Reject", "danger", rejectCallback, testid));
-  }
+  if (moderatorOptions) {}
 
   return (
killedBy: ModerateAliases Page Tests renders aliases with approve/reject buttons for moderators; AliasApprovalTable tests renders the header even with no data
statusReason: Unable to find an element by: [data-testid="Aliasapprovaltable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/components/AliasApproval/AliasApprovalTable.jsx:26:38
 
   return (
     <OurTable
-      data={aliases.filter((user) => user.status === "AWAITING_REVIEW")}
+      data={aliases.filter((user) => user.status !== "AWAITING_REVIEW")}
       columns={columns}
       testid={testid}
killedBy: ModerateAliases Page Tests renders aliases with approve/reject buttons for moderators; AliasApprovalTable tests only renders users with AWAITING_REVIEW status
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  vnarasiman
Received:
  test

Ignored nodes: comments, script, style
