[Killed] BooleanLiteral
main/components/MenuItem/MenuItemTable.jsx:19:9
   };
 
   const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
+    if (reviews || !Array.isArray(reviews) || reviews.length === 0)
       return "No reviews";
     const validRatings = reviews
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No reviews
