[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:24:19
     },
   });
 
-  useEffect(() => {
-    if (initialContents?.reviewerComments !== undefined) {
-      reset({
-        reviewerComments: initialContents.reviewerComments,
-        itemsStars: initialContents.itemsStars,
-        dateItemServed: initialContents.dateItemServed?.slice(0, 16) ?? "",
-      });
-    }
-  }, [initialContents, reset]);
+  useEffect(() => {}, [initialContents, reset]);
 
   const onSubmit = (data) => {
killedBy: ReviewForm uses empty date when initialContents has no dateItemServed; EditReviewPage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(Some comment)

Expected the element to have value:
  Some comment
Received:


Ignored nodes: comments, script, style

[Killed] EqualityOperator
main/components/MyReviews/ReviewForm.jsx:25:9
   });
 
   useEffect(() => {
-    if (initialContents?.reviewerComments !== undefined) {
+    if (initialContents?.reviewerComments === undefined) {
       reset({
         reviewerComments: initialContents.reviewerComments,
killedBy: ReviewForm shows required error and does not submit when comments are empty
statusReason: Cannot read properties of undefined (reading 'reviewerComments')

[Killed] OptionalChaining
main/components/MyReviews/ReviewForm.jsx:25:9
   });
 
   useEffect(() => {
-    if (initialContents?.reviewerComments !== undefined) {
+    if (initialContents.reviewerComments !== undefined) {
       reset({
         reviewerComments: initialContents.reviewerComments,
killedBy: ReviewForm shows required error and does not submit when comments are empty
statusReason: Cannot read properties of undefined (reading 'reviewerComments')

[Killed] OptionalChaining
main/components/MyReviews/ReviewForm.jsx:29:25
       reset({
         reviewerComments: initialContents.reviewerComments,
         itemsStars: initialContents.itemsStars,
-        dateItemServed: initialContents.dateItemServed?.slice(0, 16) ?? "",
+        dateItemServed: initialContents.dateItemServed.slice(0, 16) ?? "",
       });
     }
killedBy: ReviewForm uses empty date when initialContents has no dateItemServed
statusReason: Cannot read properties of null (reading 'slice')

[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:34:30
     }
   }, [initialContents, reset]);
 
-  const onSubmit = (data) => {
-    submitAction({
-      reviewerComments: data.reviewerComments,
-      itemsStars: Number(data.itemsStars),
-      dateItemServed: data.dateItemServed,
-    });
-
-    reset();
-  };
+  const onSubmit = (data) => {};
 
   return (
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post; EditReviewPage tests submits updated review and navigates back; ReviewForm uses empty date when initialContents has no dateItemServed
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/MyReviews/ReviewForm.jsx:72:32
       <Form.Group className="mb-3">
         <Form.Label htmlFor="itemsStars">Stars (1 to 5)</Form.Label>
         <Form.Select id="itemsStars" {...register("itemsStars")}>
-          {[1, 2, 3, 4, 5].map((n) => (
-            <option key={n} value={n}>
-              {n}
-            </option>
-          ))}
+          {[1, 2, 3, 4, 5].map(() => undefined)}
         </Form.Select>
       </Form.Group>
killedBy: EditReviewPage tests renders form fields with expected defaults; MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expect(element).toHaveValue(3)

Expected the element to have value:
  3
Received:
  undefined
