[Killed] ArrowFunction
src/main/components/OurTable.jsx:11:27
   return (
     <Table {...getTableProps()} striped bordered hover>
       <thead>
-        {headerGroups.map((headerGroup, i) => (
-          <tr
-            {...headerGroup.getHeaderGroupProps()}
-            data-testid={`${testid}-header-group-${i}`}
-            // Stryker disable next-line StringLiteral : React key property not exposed in dom
-            key={`${testid}-header-group-${i}`}
-          >
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps(column.getSortByToggleProps())}
-                data-testid={`${testid}-header-${column.id}`}
-                // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                key={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-                {/* Stryker disable next-line StringLiteral */}
-                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
-                </span>
-              </th>
-            ))}
-          </tr>
-        ))}
+        {headerGroups.map(() => undefined)}
       </thead>
       <tbody {...getTableBodyProps()}>
killedBy: MenuItemTable Tests Headers appear and empty table renders correctly without buttons
statusReason: Unable to find an element by: [data-testid="MenuItemTable-header-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
src/main/components/OurTable.jsx:18:38
             // Stryker disable next-line StringLiteral : React key property not exposed in dom
             key={`${testid}-header-group-${i}`}
           >
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps(column.getSortByToggleProps())}
-                data-testid={`${testid}-header-${column.id}`}
-                // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                key={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-                {/* Stryker disable next-line StringLiteral */}
-                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
-                </span>
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: MenuItemTable Tests Headers appear and empty table renders correctly without buttons
statusReason: Unable to find an element by: [data-testid="MenuItemTable-header-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Timeout] StringLiteral
src/main/components/OurTable.jsx:27:36
               >
                 {column.render("Header")}
                 {/* Stryker disable next-line StringLiteral */}
-                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
+                <span data-testid={``}>
                   {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
                 </span>

[Killed] StringLiteral
src/main/components/OurTable.jsx:55:34
                     // Stryker disable next-line StringLiteral : React key property not exposed in dom
                     key={testId}
                   >
-                    {cell.render("Cell")}
+                    {cell.render("")}
                   </td>
                 );
killedBy: AliasApprovalTable tests only renders users with AWAITING_REVIEW status
statusReason: Renderer Error ☝️

[Killed] ObjectLiteral
src/main/components/OurTable.jsx:93:18
 // ];
 
 export function ButtonColumn(label, variant, callback, testid) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    ),
-  };
+  const column = {};
   return column;
 }
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: A column ID (or string accessor) is required!
