[Killed] BlockStatement
main/components/Reviews/ModeratorCommentsModal.jsx:12:30
 }) {
   const [comments, setComments] = useState("");
 
-  const handleSubmit = () => {
-    onSubmit(comments);
-    setComments("");
-    onHide();
-  };
+  const handleSubmit = () => {};
 
   const handleClose = () => {
killedBy: ModerateReviewsPage end-to-end approve from page sends moderation PUT; ModeratorCommentsModal submit without typing sends an empty comments string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Reviews/ModeratorCommentsModal.jsx:18:29
     onHide();
   };
 
-  const handleClose = () => {
-    setComments("");
-    onHide();
-  };
+  const handleClose = () => {};
 
   return (
killedBy: ModeratorCommentsModal cancel dismisses without submitting and clears the textarea
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
  data-testid="ModeratorCommentsModal-title"
>
  Approve Review
</div> instead

[Killed] ConditionalExpression
main/components/Reviews/ModeratorCommentsModal.jsx:31:12
     >
       <Modal.Header closeButton data-testid="ModeratorCommentsModal-header">
         <Modal.Title data-testid="ModeratorCommentsModal-title">
-          {status === "APPROVED" ? "Approve Review" : "Reject Review"}
+          {true ? "Approve Review" : "Reject Review"}
         </Modal.Title>
       </Modal.Header>
killedBy: ModeratorCommentsModal shows reject heading and danger action when status is REJECTED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Reject Review
Received:
  Approve Review

[Killed] ConditionalExpression
main/components/Reviews/ModeratorCommentsModal.jsx:31:12
     >
       <Modal.Header closeButton data-testid="ModeratorCommentsModal-header">
         <Modal.Title data-testid="ModeratorCommentsModal-title">
-          {status === "APPROVED" ? "Approve Review" : "Reject Review"}
+          {false ? "Approve Review" : "Reject Review"}
         </Modal.Title>
       </Modal.Header>
killedBy: ModeratorCommentsModal shows approve heading and primary action when status is APPROVED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve Review
Received:
  Reject Review

[Killed] ConditionalExpression
main/components/Reviews/ModeratorCommentsModal.jsx:60:20
           Cancel
         </Button>
         <Button
-          variant={status === "APPROVED" ? "primary" : "danger"}
+          variant={false ? "primary" : "danger"}
           onClick={handleSubmit}
           data-testid="ModeratorCommentsModal-submit"
killedBy: ModeratorCommentsModal shows approve heading and primary action when status is APPROVED
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn btn-danger

[Killed] ConditionalExpression
main/components/Reviews/ModeratorCommentsModal.jsx:64:12
           onClick={handleSubmit}
           data-testid="ModeratorCommentsModal-submit"
         >
-          {status === "APPROVED" ? "Approve" : "Reject"}
+          {true ? "Approve" : "Reject"}
         </Button>
       </Modal.Footer>
killedBy: ModeratorCommentsModal shows reject heading and danger action when status is REJECTED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Reject
Received:
  Approve

[Killed] ConditionalExpression
main/components/Reviews/ModeratorCommentsModal.jsx:64:12
           onClick={handleSubmit}
           data-testid="ModeratorCommentsModal-submit"
         >
-          {status === "APPROVED" ? "Approve" : "Reject"}
+          {false ? "Approve" : "Reject"}
         </Button>
       </Modal.Footer>
killedBy: ModeratorCommentsModal shows approve heading and primary action when status is APPROVED
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve
Received:
  Reject
