[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:49:37
   );
   // Stryker restore all
 
-  const approveCallback = (cell) => {
-    setPendingStatus("APPROVED");
-    setPendingCell(cell);
-    setModalShow(true);
-  };
+  const approveCallback = (cell) => {};
 
   const rejectCallback = (cell) => {
killedBy: ModerateReviewsPage end-to-end approve from page sends moderation PUT
statusReason: Unable to find an element by: [data-testid="ModeratorCommentsModal-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:52:18
   const approveCallback = (cell) => {
     setPendingStatus("APPROVED");
     setPendingCell(cell);
-    setModalShow(true);
+    setModalShow(false);
   };
 
killedBy: ModerateReviewsPage end-to-end approve from page sends moderation PUT; ReviewsTable approve opens comments modal with correct title
statusReason: Unable to find an element by: [data-testid="ModeratorCommentsModal-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:61:43
     setModalShow(true);
   };
 
-  const handleModalSubmit = (comments) => {
-    moderateMutation.mutate({
-      cell: pendingCell,
-      status: pendingStatus,
-      moderatorComments: comments,
-    });
-  };
+  const handleModalSubmit = (comments) => {};
 
   // Stryker disable all
killedBy: ModerateReviewsPage end-to-end approve from page sends moderation PUT; ReviewsTable approval flow sends PUT with status and moderatorComments
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:116:15
 
   if (moderatorOptions) {
     columns.splice(1, 0, {
-      Header: "Reviewer Email",
+      Header: "",
       accessor: "reviewer.email",
     });
killedBy: ModerateReviewsPage moderator sees moderation actions and no dialog on load
statusReason: Unable to find an element with the text: Reviewer Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Reviews/ReviewsTable.jsx:131:17
     <>
       <ModeratorCommentsModal
         show={modalShow}
-        onHide={() => setModalShow(false)}
+        onHide={() => undefined}
         status={pendingStatus}
         onSubmit={handleModalSubmit}
killedBy: ModerateReviewsPage cancel on the page closes the comments dialog
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
  data-testid="ModeratorCommentsModal-title"
>
  Approve Review
</div> instead

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:135:58
         status={pendingStatus}
         onSubmit={handleModalSubmit}
       />
-      <OurTable data={reviews} columns={columns} testid={"Reviewstable"} />
+      <OurTable data={reviews} columns={columns} testid={""} />
     </>
   );
killedBy: ModerateReviewsPage moderator sees moderation actions and no dialog on load; MyReviewsIndexPage tests renders three reviews correctly for regular user
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
