[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.jsx:16:13
   const cellToAxiosParamsDelete = (cell) => ({
     url: deleteEndpoint,
     method: "DELETE",
-    params: {
-      email: cell.row.original.email,
-    },
+    params: {},
   });
 
killedBy: ModeratorsIndexPage tests what happens when you click delete; AdminsIndexPage tests what happens when you click delete; RoleEmailTable Check defaults for api endpoints
statusReason: expected {} to deeply equal { email: 'moderator1@example.com' }

[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:21:40
     },
   });
 
-  const onDeleteSuccess = (message) => {
-    toast(message);
-  };
+  const onDeleteSuccess = (message) => {};
 
   const deleteMutation = useBackendMutation(
killedBy: ModeratorsIndexPage tests what happens when you click delete; AdminsIndexPage tests what happens when you click delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'first moderator deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Users/RoleEmailTable.jsx:32:5
   );
 
   const deleteCallback =
-    customDeleteCallback || ((cell) => deleteMutation.mutate(cell));
+    false;
 
   const columns = [
killedBy: AdminsIndexPage tests what happens when you click delete; RoleEmailTable calls deleteCallback when Delete button clicked; ModeratorsIndexPage tests what happens when you click delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'first moderator deleted' ]

Received: 

  1st vi.fn() call:

  [
-   "first moderator deleted",

[Killed] ArrowFunction
main/components/Users/RoleEmailTable.jsx:32:30
   );
 
   const deleteCallback =
-    customDeleteCallback || ((cell) => deleteMutation.mutate(cell));
+    customDeleteCallback || (() => undefined);
 
   const columns = [
killedBy: RoleEmailTable Check defaults for api endpoints; ModeratorsIndexPage tests what happens when you click delete; AdminsIndexPage tests what happens when you click delete
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.jsx:35:5
     customDeleteCallback || ((cell) => deleteMutation.mutate(cell));
 
   const columns = [
-    {
-      Header: "Email",
-      accessor: "email",
-    },
+    {},
     {
       Header: "Delete",
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/RoleEmailTable.jsx:40:15
       accessor: "email",
     },
     {
-      Header: "Delete",
+      Header: "",
       accessor: "isInAdminEmails",
       Cell: ({ cell }) => {
killedBy: RoleEmailTable renders table with email data plus isInAdminEmails
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Delete
Received:

[Killed] BlockStatement
main/components/Users/RoleEmailTable.jsx:43:49
       Header: "Delete",
       accessor: "isInAdminEmails",
       Cell: ({ cell }) => {
-        if (!cell.row.original.isInAdminEmails) {
-          return (
-            <Button
-              className="btn btn-danger"
-              onClick={() => deleteCallback(cell)}
-              data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        }
+        if (!cell.row.original.isInAdminEmails) {}
         return (
           <span
killedBy: RoleEmailTable renders table with email data; AdminsIndexPage tests renders three items correctly; ModeratorsIndexPage tests renders three items correctly
statusReason: Unable to find an accessible element with the role "button" and name `/delete/i`

Here are the accessible roles:

  table:

  Name "":
  <table
