[Killed] StringLiteral
main/components/Users/UsersTable.jsx:17:15
   const toggleAdminMutation = useBackendMutation(
     (row) => ({
       url: "/api/admin/toggleAdmin",
-      method: "PUT",
+      method: "",
       params: { id: row.id },
     }),
killedBy: UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage; AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Updated admin status for user Phill",

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:26:53
         // stryker mutates by removing ?'s - when we are not admin, this page is not accessible, so currentUsers.root.user is guaranteed to have values
         // non-self navigate behavior is tested implicitly via AdminUsersPage tests
         // Stryker disable next-line OptionalChaining, ConditionalExpression
-        if (row.id === currentUser?.root?.user?.id) {
-          navigate("/");
-        }
+        if (row.id === currentUser?.root?.user?.id) {}
       },
       // skip cache invalidation for self-toggle: we're navigating away and are no longer admin, so the refetch would 403
killedBy: UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage
statusReason: expected "vi.fn()" to be called with arguments: [ '/' ]

Number of calls: 0

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:50:5
 
   // helper function to toggle moderator status
   const toggleModeratorMutation = useBackendMutation(
-    (row) => ({
-      url: "/api/admin/toggleModerator",
-      method: "PUT",
-      params: { id: row.id },
-    }),
+    () => undefined,
     {
       onSuccess: (_data, row) =>
killedBy: AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected 1 to be greater than or equal to 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:73:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "First Name",
-      accessor: "givenName",
-    },
+    {},
     {
       Header: "Last Name",
killedBy: ProfilePage tests renders correctly for regular logged in user; AdminUsersPage tests renders without crashing on three users
statusReason: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:75:17
     },
     {
       Header: "First Name",
-      accessor: "givenName",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-givenName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:98:25
               aria-label="admin"
               name="adminToggle"
               checked={row.admin}
-              onChange={() => handleAdminToggle(row)}
+              onChange={() => undefined}
             />
           </div>
killedBy: UserTable tests clicking admin checkbox on self shows success toast and navigates to homepage; AdminUsersPage tests toggling admin and moderator checkboxes updates the table after backend responds
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:106:11
     },
     {
       Header: "Moderator",
-      id: "moderator",
+      id: "",
       accessor: (row) => {
         return (
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-moderator"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:134:13
     {
       Header: "Status",
       accessor: (row) => {
-        if (row.status === "Approved" && row.dateApproved) {
+        if (true && row.dateApproved) {
           // Parse as local date (YYYY-MM-DD)
           const [year, month, day] = row.dateApproved.split("-");
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Rejected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:136:61
       accessor: (row) => {
         if (row.status === "Approved" && row.dateApproved) {
           // Parse as local date (YYYY-MM-DD)
-          const [year, month, day] = row.dateApproved.split("-");
+          const [year, month, day] = row.dateApproved.split("");
           const formattedDate = new Date(
             year,
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
