[Killed] ArrowFunction
src/main/pages/HomePage.jsx:38:16
   const mealsOffered = useQueries(queries);
 
   const combined = Array.isArray(data)
-    ? data.map((d, i) => ({
-        ...d,
-        mealsOfferedToday: mealsOffered[i]?.data ?? [],
-      }))
+    ? data.map(() => undefined)
     : // Stryker disable next-line all : default empty array when dining data is missing
       [];
killedBy: HomePage tests Renders table with 4 dining commons
statusReason: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
