[Killed] BlockStatement
main/pages/Meal/MealTimesPage.jsx:23:31
   const [selectedDate, setSelectedDate] = useState(dateTime);
   const navigate = useNavigate();
 
-  const onChangeDate = (e) => {
-    const newDate = e.target.value;
-    setSelectedDate(newDate);
-    navigate(`/diningcommons/${newDate}/${diningCommonsCode}`);
-  };
+  const onChangeDate = (e) => {};
 
   if (status === 204) {
killedBy: MealTimesPage tests changing the date navigates to correct URL
statusReason: expected "vi.fn()" to be called with arguments: [ '/diningcommons/2025-11-01/portola' ]

Number of calls: 0

[Killed] StringLiteral
main/pages/Meal/MealTimesPage.jsx:30:21
   };
 
   if (status === 204) {
-    const message = `${diningCommonsCode} is closed on ${dateTime}. Please select another date or dining common.`;
+    const message = ``;
     toast(message, { toastId: "closed-dining-commons" });
     return (
killedBy: MealTimesPage tests when backend returns 204, displays toast message
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "portola is closed on 2024-11-25. Please select another date or dining common.",
