[Killed] StringLiteral
src/main/pages/ModerateReviewsPage.jsx:14:27
 
   const { data: reviews } = useBackend(
     ["/api/reviews/needsmoderation"],
-    { method: "GET", url: "/api/reviews/needsmoderation" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: ModerateReviewsPage moderator sees moderation actions and no dialog on load
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ModerateReviewsPage.jsx:19:5
   );
 
   const moderateReviewsOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_MODERATOR");
 
   return (
killedBy: ModerateReviewsPage moderator sees moderation actions and no dialog on load
statusReason: Unable to find an element with the text: Reviewer Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
