[Killed] ArrayDeclaration
main/pages/Reviews/EditReviewPage.jsx:14:5
   const navigate = useNavigate();
 
   const { data: review } = useBackend(
-    [`/api/reviews/${id}`],
+    [],
     {
       method: "GET",
killedBy: EditReviewPage tests useBackend is called with correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/reviews/2' ], …(2) ]

Received: 

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] OptionalChaining
main/pages/Reviews/EditReviewPage.jsx:35:35
       navigate(-1);
     } catch (err) {
       toast.error(
-        `Error updating review: ${err.response?.data?.error || err.message}`,
+        `Error updating review: ${err.response?.data.error || err.message}`,
       );
     }
killedBy: EditReviewPage tests shows fallback error when response data is explicitly null
statusReason: Unable to find an element with the text: /Error updating review: Request failed with status code 500/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:35:35
       navigate(-1);
     } catch (err) {
       toast.error(
-        `Error updating review: ${err.response?.data?.error || err.message}`,
+        `Error updating review: ${true}`,
       );
     }
killedBy: EditReviewPage tests shows error toast on network error during edit with fallback message
statusReason: Unable to find an element with the text: /Error updating review: timeout of 0ms exceeded/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
