[Killed] BlockStatement
main/pages/Reviews/PostReviewPage.jsx:42:19
       // Stryker disable next-line all : itemName will be defined
       toast(`Review submitted for ${itemName}`);
       navigate(-1);
-    } catch (err) {
-      toast.error(
-        `Error submitting review: ${err.response?.data?.error || err.message}`,
-      );
-    }
+    } catch (err) {}
   };
 
killedBy: MyReviewsCreatePage - full coverage tests shows error toast on network error during post with fallback message
statusReason: Unable to find an element with the text: /Error submitting review: timeout of 0ms exceeded/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Reviews/PostReviewPage.jsx:44:37
       navigate(-1);
     } catch (err) {
       toast.error(
-        `Error submitting review: ${err.response?.data?.error || err.message}`,
+        `Error submitting review: ${err.response?.data.error || err.message}`,
       );
     }
killedBy: MyReviewsCreatePage - full coverage tests shows fallback error when response data is explicitly null
statusReason: Unable to find an element with the text: /Error submitting review: Request failed with status code 500/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
