[Killed] StringLiteral
src/main/utils/Aliases.jsx:16:8
 // Stryker disable next-line ArrowFunction
 export const cellToAxiosParamsReject = (cell) => ({
   method: "PUT",
-  url: "/api/currentUser/updateAliasModeration",
+  url: "",
   params: {
     id: cell.row.original.id,
killedBy: Aliases Utils cellToAxiosParamsReject returns the correct params for REJECTED
statusReason: expected { method: 'PUT', url: '', …(1) } to deeply equal { …(3) }
