[Killed] ObjectLiteral
src/main/utils/currentUser.jsx:27:20
     // Stryker disable next-line ObjectLiteral
     {
       // Stryker disable next-line BooleanLiteral
-      initialData: { loggedIn: false, root: null, initialData: true },
+      initialData: {},
     },
   );
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: expected {} to deeply equal { loggedIn: false, root: null, …(1) }

[Killed] BlockStatement
src/main/utils/currentUser.jsx:32:29
   );
 }
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    void queryClient.resetQueries("current user", { exact: true });
-    navigate("/");
-  });
-  return mutation;
-}
+export function useLogout() {}
 
 export function hasRole(currentUser, role) {
killedBy: ModerateReviewsPage moderator sees moderation actions and no dialog on load
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] BooleanLiteral
src/main/utils/currentUser.jsx:37:60
   const navigate = useNavigate();
   const mutation = useMutation(async () => {
     await axios.post("/logout");
-    void queryClient.resetQueries("current user", { exact: true });
+    void queryClient.resetQueries("current user", { exact: false });
     navigate("/");
   });
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: expected "resetQueries" to be called with arguments: [ 'current user', { exact: true } ]

Received: 

  1st resetQueries call:

  [
    "current user",

[Killed] BlockStatement
src/main/utils/currentUser.jsx:43:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-  // The following hack is because there is some bug in terms of the
-  // shape of the data returned by useCurrentUser.  Is there a separate
-  // data level, or not?
-
-  // We will file an issue to track that down and then remove this hack
-
-  if (currentUser == null) return false;
-
-  // Stryker disable next-line OptionalChaining, ConditionalExpression
-  if (currentUser.data?.root?.rolesList) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
-
-  return currentUser.root?.rolesList?.includes(role);
-}
+export function hasRole(currentUser, role) {}
 
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves data from API
statusReason: expected { loggedIn: false, root: null, …(1) } to deeply equal { loggedIn: true, root: { …(3) } }

[Killed] EqualityOperator
src/main/utils/currentUser.jsx:50:7
 
   // We will file an issue to track that down and then remove this hack
 
-  if (currentUser == null) return false;
+  if (currentUser != null) return false;
 
   // Stryker disable next-line OptionalChaining, ConditionalExpression
killedBy: ModerateReviewsPage moderator sees moderation actions and no dialog on load; MenuItemTable Tests Navigation uses correct menu item id
statusReason: Unable to find an element with the text: Reviewer Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
