[Timeout] ObjectLiteral
src/main/utils/systemInfo.jsx:19:20
     },
     // Stryker disable next-line ObjectLiteral
     {
-      initialData: {
-        initialData: true,
-        springH2ConsoleEnabled: false,
-        // Stryker disable next-line BooleanLiteral
-        showSwaggerUILink: false,
-      },
+      initialData: {},
     },
   );
